###############################################################################
# Created by write_sdc
###############################################################################
current_design SG13CMOS5LTop
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk_core -period 20.0000 [get_pins {sg13cmos5l_IOPad_io_clock/p2c}]
set_clock_transition 0.2500 [get_clocks {clk_core}]
set_clock_uncertainty 0.0500 clk_core
set_propagated_clock [get_clocks {clk_core}]
set_input_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_address_0_PAD}]
set_input_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_address_0_PAD}]
set_input_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_address_1_PAD}]
set_input_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_address_1_PAD}]
set_input_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_address_2_PAD}]
set_input_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_address_2_PAD}]
set_input_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_gpio_0_PAD}]
set_input_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_gpio_0_PAD}]
set_input_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_gpio_1_PAD}]
set_input_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_gpio_1_PAD}]
set_input_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_gpio_2_PAD}]
set_input_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_gpio_2_PAD}]
set_input_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_gpio_3_PAD}]
set_input_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_gpio_3_PAD}]
set_input_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_gpio_4_PAD}]
set_input_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_gpio_4_PAD}]
set_input_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_gpio_5_PAD}]
set_input_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_gpio_5_PAD}]
set_input_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_gpio_6_PAD}]
set_input_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_gpio_6_PAD}]
set_input_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_gpio_7_PAD}]
set_input_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_gpio_7_PAD}]
set_input_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_i2c_scl_PAD}]
set_input_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_i2c_scl_PAD}]
set_input_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_i2c_sda_PAD}]
set_input_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_i2c_sda_PAD}]
set_input_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_reset_PAD}]
set_input_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_reset_PAD}]
set_output_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_gpio_0_PAD}]
set_output_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_gpio_0_PAD}]
set_output_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_gpio_1_PAD}]
set_output_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_gpio_1_PAD}]
set_output_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_gpio_2_PAD}]
set_output_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_gpio_2_PAD}]
set_output_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_gpio_3_PAD}]
set_output_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_gpio_3_PAD}]
set_output_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_gpio_4_PAD}]
set_output_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_gpio_4_PAD}]
set_output_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_gpio_5_PAD}]
set_output_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_gpio_5_PAD}]
set_output_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_gpio_6_PAD}]
set_output_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_gpio_6_PAD}]
set_output_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_gpio_7_PAD}]
set_output_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_gpio_7_PAD}]
set_output_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_i2c_interrupt_PAD}]
set_output_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_i2c_interrupt_PAD}]
set_output_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_i2c_scl_PAD}]
set_output_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_i2c_scl_PAD}]
set_output_delay 0.5000 -clock [get_clocks {clk_core}] -min -add_delay [get_ports {io_i2c_sda_PAD}]
set_output_delay 4.0000 -clock [get_clocks {clk_core}] -max -add_delay [get_ports {io_i2c_sda_PAD}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 4.0000 [get_ports {io_gpio_0_PAD}]
set_load -pin_load 4.0000 [get_ports {io_gpio_1_PAD}]
set_load -pin_load 4.0000 [get_ports {io_gpio_2_PAD}]
set_load -pin_load 4.0000 [get_ports {io_gpio_3_PAD}]
set_load -pin_load 4.0000 [get_ports {io_gpio_4_PAD}]
set_load -pin_load 4.0000 [get_ports {io_gpio_5_PAD}]
set_load -pin_load 4.0000 [get_ports {io_gpio_6_PAD}]
set_load -pin_load 4.0000 [get_ports {io_gpio_7_PAD}]
set_load -pin_load 4.0000 [get_ports {io_i2c_interrupt_PAD}]
set_load -pin_load 4.0000 [get_ports {io_i2c_scl_PAD}]
set_load -pin_load 4.0000 [get_ports {io_i2c_sda_PAD}]
set_driving_cell -lib_cell sg13cmos5l_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_address_0_PAD}]
set_driving_cell -lib_cell sg13cmos5l_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_address_1_PAD}]
set_driving_cell -lib_cell sg13cmos5l_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_address_2_PAD}]
set_driving_cell -lib_cell sg13cmos5l_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_clock_PAD}]
set_driving_cell -lib_cell sg13cmos5l_IOPadInOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpio_0_PAD}]
set_driving_cell -lib_cell sg13cmos5l_IOPadInOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpio_1_PAD}]
set_driving_cell -lib_cell sg13cmos5l_IOPadInOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpio_2_PAD}]
set_driving_cell -lib_cell sg13cmos5l_IOPadInOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpio_3_PAD}]
set_driving_cell -lib_cell sg13cmos5l_IOPadInOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpio_4_PAD}]
set_driving_cell -lib_cell sg13cmos5l_IOPadInOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpio_5_PAD}]
set_driving_cell -lib_cell sg13cmos5l_IOPadInOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpio_6_PAD}]
set_driving_cell -lib_cell sg13cmos5l_IOPadInOut16mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_gpio_7_PAD}]
set_driving_cell -lib_cell sg13cmos5l_IOPadInOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_i2c_scl_PAD}]
set_driving_cell -lib_cell sg13cmos5l_IOPadInOut4mA -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_i2c_sda_PAD}]
set_driving_cell -lib_cell sg13cmos5l_IOPadIn -pin {pad} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {io_reset_PAD}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
